Repository: MinDeaDBlood/TIK
Catalog: locales/*/LC_MESSAGES/*.po
Languages: ru

source: Binary file not found Your device may not be supported
ru: Двоичный файл не найден Возможно, ваше устройство не поддерживается

source: Cannot remove the folder, insufficient permissions
ru: Не удается удалить папку, недостаточно разрешений

source: Successfully deleted!
ru: Удалено успешно!

source: Error: {exception_type.__name__}
ru: Ошибка: {exception_type.__name__}

source: Description: {exception}
ru: Описание: {exception}

source: Line: {exception.__traceback__.tb_lineno} Module: {exception.__traceback__.tb_frame.f_globals['__name__']}
ru: Строки: {exception.__traceback__.tb_lineno} Модуль: {exception.__traceback__.tb_frame.f_globals['__name__']}

source: Platform: {plat.machine()} System: {plat.uname().system} {plat.uname().release}
ru: Платформа: {plat.machine()} Система: {plat.uname().system} {plat.uname().release}

source: Python version: {sys.version[:6]} Program version: {version}
ru: Версия Python: {sys.version[:6]} Версия программы: {version}

source: You are using the latest version! Press any key to return!
ru: Вы используете последнюю версию! Нажмите любую кнопку для возврата!

source: Failed to connect to the server, press any key to return
ru: Не удалось подключиться к серверу, нажмите любую кнопку для возврата

source: New version: {current_version} --> {new_version}
ru: Новая версия: {current_version} --> {new_version}

source: Changes: {changes_log}
ru: Изменения: {changes_log}

source: Update not found, please visit the link
ru: Обновление не найдено, пожалуйста, перейдите по ссылке

source: Input error!
ru: Ошибка ввода!

source: Thank you for using TI-KITCHEN5, goodbye!
ru: Спасибо за использование TI-KITCHEN5, до свидания!

source: Welcome to the Tool!
ru: Добро пожаловать в инструмент!

source: Hello! Please select an option:
ru: Здравствуйте! Пожалуйста, выберите вариант:

source: Please enter the project number you want to delete:
ru: Пожалуйста, введите число проекта, который хотите удалить:

source: Failed to download, please try again later
ru: Ошибка загрузки, пожалуйста, повторите попытку позже

source: Parsing error: %s
ru: Ошибка анализа: %s

source: Build failed
ru: Сборка завершилась неудачей

source: Build image in sparse?
ru: Собрать образ в sparse?

source: Create a dynamic partition image?
ru: Создать образ динамического раздела?

source: Please choose a compression method for EROFS: lz4/lz4hc/lzma
ru: Пожалуйста, выберите способ сжатия для EROFS: lz4/lz4hc/lzma

source: Select the type of filesystem: [1] Original [2] Choose (ext4 <==> erofs)
ru: Выберите тип файловой системы: [1] Оригинал [2] Выбрать (ext4 <==> erofs)

source: Do you want to use sparse image?
ru: Хотите использовать sparse образ?

source: Please enter your customization:
ru: Пожалуйста, введите свои настройки:

source: Looking for updates...
ru: Поиск обновлений...

source: You must specify a URL to download.
ru: Вы должны указать URL для загрузки.

source: Update successful! Press any key to continue.
ru: Обновление успешно! Нажмите любую клавишу для продолжения.

source: Installation complete! You can now run the program.
ru: Установка завершена! Вы можете теперь запустить программу.

source: Invalid input! Please try again.
ru: Недопустимый ввод! Пожалуйста, попробуйте снова.

source: An unknown error occurred: %s
ru: Произошла неизвестная ошибка: %s

source: Do you want to exit the program? [1] Yes [2] No
ru: Вы хотите выйти из программы? [1] Да [2] Нет

source: Please select the extraction method:
ru: Пожалуйста, выберите метод распаковки:

source: Current version: {version}
ru: Текущая версия: {version}

source: Unknown file type
ru: Неизвестный тип файла

source: Successfully unpacked: %s
ru: Успешно распаковано: %s

source: Please wait, processing...
ru: Пожалуйста, подождите, идет обработка...

source: You have a new update available.
ru: У вас доступно новое обновление.

source: File not found: %s
ru: Файл не найден: %s

source: Directory created: %s
ru: Каталог создан: %s

source: Operation completed successfully.
ru: Операция выполнена успешно.

source: Please ensure you have the necessary permissions.
ru: Пожалуйста, убедитесь, что у вас есть необходимые разрешения.

source: Could not complete the operation.
ru: Не удалось завершить операцию.

source: Missing required argument: %s
ru: Отсутствует обязательный аргумент: %s

source: Retrieving information, please wait...
ru: Получение информации, пожалуйста, подождите...

source: The selected option is not valid.
ru: Выбранный вариант недоступен.

source: Clearing temporary files...
ru: Очистка временных файлов...

source: Backup completed successfully.
ru: Резервное копирование выполнено успешно.

source: Please configure your settings.
ru: Пожалуйста, настройте свои параметры.

source: Item not found!
ru: Элемент не найден!

source: Configuration saved successfully!
ru: Конфигурация успешно сохранена!

source: Processing files, please wait...
ru: Обработка файлов, пожалуйста, подождите...

source: This feature is not yet implemented.
ru: Эта функция пока не реализована.

source: Are you sure you want to continue?
ru: Вы уверены, что хотите продолжить?

source: Insufficient space for operation.
ru: Недостаточно места для операции.

source: File already exists: %s
ru: Файл уже существует: %s

source: Welcome to TI-KITCHEN5!
ru: Добро пожаловать в TI-KITCHEN5!

source: Downloading update...
ru: Скачивание обновления...

source: Verifying file...
ru: Проверка файла...

source: Cleanup completed.
ru: Очистка завершена.

source: The operation was cancelled.
ru: Операция была отменена.

source: File processing error: %s
ru: Ошибка обработки файла: %s

source: Loading configuration...
ru: Загрузка конфигурации...
